import pandas as pd

##Pivot Table
#pivot dataframe such that columns and rows are changed

data = {
    "도시": ["서울", "서울", "서울", "부산", "부산", "부산", "인천", "인천"],
    "연도": ["2015", "2010", "2005", "2015", "2010", "2005", "2015", "2010"],
    "인구": [9904312, 9631482, 9762546, 3448737, 3393191, 3512547, 2886172, 2660610],
    "지역": ["수도권", "수도권", "수도권", "경상권", "경상권", "경상권", "수도권", "수도권"]}
columns = ["도시", "연도", "인구", "지역"]
    
df1 = pd.DataFrame(data, columns=columns)
print(df1)
#   도시    연도       인구   지역
#0  서울  2015  9904312  수도권
#1  서울  2010  9631482  수도권
#2  서울  2005  9762546  수도권
#3  부산  2015  3448737  경상권
#4  부산  2010  3393191  경상권
#5  부산  2005  3512547  경상권
#6  인천  2015  2886172  수도권
#7  인천  2010  2660610  수도권
print()
df2 = df1.pivot( "도시",  "연도",  "인구")
print(df2)
print()
#연도       2005       2010       2015
#도시
#부산  3512547.0  3393191.0  3448737.0
#서울  9762546.0  9631482.0  9904312.0
#인천        NaN  2660610.0  2886172.0

print( df2.columns)
#Index(['2005', '2010', '2015'], dtype='object', name='연도')
print( df2.index)
#Index(['부산', '서울', '인천'], dtype='object', name='도시')
print()
print( df2[ "2015" ] )
print()
#도시
#부산    3448737.0
#서울    9904312.0
#인천    2886172.0
#Name: 2015, dtype: float64
print( df2.loc[ "서울" ] )
#연도
#2005    9762546.0
#2010    9631482.0
#2015    9904312.0
#Name: 서울, dtype: float64
